Repository: cristi3lup/wedding_app
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ro

source: Event deleted.
ro: Evenimentul și datele asociate au fost șterse permanent.

source: Guest limit reached.
ro: Ai atins plafonul maxim de invitați.

source: Guest added.
ro: Lista crește. Invitat adăugat cu succes.

source: Edit Guest: %(name)s
ro: Se editează datele: %(name)s

source: Guest deleted.
ro: A fost șters din lista de invitați.

source: Stripe Error: %(error)s
ro: Eroare la procesatorul de plată Stripe: %(error)s

source: Payment successful! Your plan has been upgraded.
ro: Succes! Plata a fost confirmată și noile limite din cont au fost deblocate.

source: Payment cancelled.
ro: Procesul de plată a fost anulat. Contul tău rămâne neschimbat.

source: Please enter a voucher code.
ro: Te rugăm să introduci un cod de reducere.

source: Invalid voucher code.
ro: Cod de reducere invalid.

source: This voucher is no longer active.
ro: Acest cod de reducere nu mai este activ.

source: This voucher has already been used.
ro: Acest cod de reducere a fost deja utilizat.

source: This voucher has expired.
ro: Acest cod de reducere a expirat.

source: This voucher is not yet active.
ro: Acest cod de reducere nu este încă activ.

source: This voucher has reached its maximum uses.
ro: Acest cod de reducere a atins limita maximă de utilizări.

source: This voucher is not valid for the selected plan.
ro: Acest cod de reducere nu este valabil pentru pachetul selectat.

source: Voucher applied successfully!
ro: Cod de reducere aplicat cu succes!

source: Invalid voucher.
ro: Voucher invalid.

source: Voucher already used.
ro: Voucher deja utilizat.

source: Voucher expired.
ro: Voucher expirat.

source: Voucher not yet active.
ro: Voucher-ul nu este încă activ.

source: This voucher is not for a free upgrade.
ro: Acest cod de reducere nu este pentru o activare gratuită.

source: Voucher reached usage limit.
ro: Voucher-ul a atins limita de utilizare.

source: Congratulations! Your plan has been upgraded to %(plan)s for free!
ro: Felicitări! Planul tău a fost activat gratuit la pachetul %(plan)s!

source: Honorific
ro: Grup (Familia/Dl.)

source: Name
ro: Nume

source: Max Attendees
ro: Nr Maxim Locuri (Bilete)

source: Missing 'Name' column
ro: Fișierul tău Excel nu conține capul de tabel obligatoriu cu denumirea 'Name'

source: Import exceeds guest limit.
ro: Importarea acestui fișier ar depăși limita maximă de persoane din abonamentul tău actual.

source: Imported %(count)d guests.
ro: Magie tehnică! %(count)d invitați au fost importați din Excel cu succes.

source: Import error: %(error)s
ro: Probleme la citirea Excel-ului: %(error)s

source: Thank you for your feedback!
ro: Feedback trimis! Îți mulțumim pentru recenzie.

source: You do not have permission to view this event.
ro: Acest link este securizat. Nu ai acces la panoul acestui eveniment.

source: Select a design to see the preview.
ro: Intră în Editare Eveniment și selectează mai întâi un design grafic din listă.

source: Sample Guest Name
ro: Nume Invitat Preview

source: Preview data expired. Please interact with the form to refresh.
ro: Datele previzualizării au expirat. Te rugăm să interacționezi cu formularul pentru a reîmprospăta.

source: Please select a template to see the preview.
ro: Te rugăm să selectezi un șablon pentru a vedea previzualizarea.

source: Create invitations crafted with love
ro: Generează invitații digitale, construite cu inima

source: Back to Homepage
ro: Înapoi la site

source: Account Confirmation
ro: Confirmare Creare Cont InvApp

source: Hello,
ro: Salutare,

source: Thank you for signing up on <strong>InvApp Romania</strong>. Please confirm your email address to activate your account.
ro: Îți mulțumim că te-ai înregistrat pe <strong>platforma InvApp</strong>. Te rugăm să dai un click pe butonul de mai jos pentru a activa adresa ta și pentru a începe conturarea primei invitații.

source: Confirm Account
ro: Activează Contul

source: If the button above does not work, you can access this link directly:
ro: Dacă butonul pare să aibă o problemă tehnică, copiază link-ul de mai jos direct în browser:

source: This message was sent automatically. Please do not reply to this email.
ro: Acesta este un email automat de sistem. Te rugăm să nu folosești funcția de 'Reply' la el.

source: Hello!
ro: Salutare!

source: Thank you for joining the InvApp Romania platform!
ro: Super! Ai intrat pe ușa cea mare în platforma InvApp România.

source: To activate your account and start creating invitations, please confirm your email address by clicking the link below:
ro: Pentru a începe distracția și a crea primele invitații, dă te rog un click de confirmare pe acest link:

source: If you did not request this account, you can ignore this message.
ro: Dacă cineva a folosit adresa ta din greșeală, poți șterge simplu acest e-mail.

source: With love,
ro: Organizare fără stres,

source: InvApp Team
ro: Echipa tehnică InvApp

source: Login failed
ro: Nu te-am putut conecta

source: Password
ro: Parolă securizată

source: Forgot?
ro: Recuperare?

source: Sign in
ro: Conectare la platformă

source: Enter Sign-In Code
ro: Introdu codul primit pe e-mail

source: We sent a code to your email. The code expires shortly, so please enter it soon.
ro: Am trimis pe e-mail un pin din cifre. Atenție: din motive de securitate, expiră în curând.

source: Error
ro: Ups. Eroare.

source: Confirmation Code
ro: Pin 6-cifre (Cod confirmare)

source: Confirm
ro: Validează Pin

source: Password Reset
ro: Resetare Parolă Cont

source: Reset Your Password
ro: Ai uitat parola? E în regulă.

source: Enter your email address below, and we'll send you a link to reset your password.
ro: Lipește aici adresa de email din contul tău, și un algoritm îți va trimite pe loc o parolă nouă.

source: Send Reset Link
ro: Trimite Link-ul

source: Back to Sign In
ro: Lasă, mi-am amintit-o

source: Password Reset Sent
ro: Procedură trimisă în căsuța ta de e-mail

source: Check Your Email
ro: Aruncă o privire în contul tău de e-mail

source: We have sent you an email. If an account exists with the email you entered, you will receive a link to reset your password shortly.
ro: Dacă emailul introdus este cel corect alăturat contului tău, e-mailul de reset este deja trimis. (Mai durează câteva secunde).

source: If you don't receive an email, please check your spam folder or verify the address you entered.
ro: Verifică atent și în folderul tău SPAM. Dacă nici acolo nu e, încearcă din nou.

source: Return to Sign In
ro: Navighează către Log in

source: Back to Home
ro: Revino pe pagină principală

source: Password Changed
ro: Securitate nouă actualizată.

source: Your password has been changed successfully. You can now sign in with your new password.
ro: Totul e pus la punct. Parola a fost schimbată, acum te poți conecta.

source: Create Account
ro: Creare cont nou gratuit

source: Continue with Google
ro: Conectare automată prin Google

source: Continue with Facebook
ro: Conectare rapidă prin Facebook

source: Or with email
ro: Sau folosește opțiunea Email

source: Verify Your Email Address
ro: Activare și Validare

source: We have sent an email to you for verification. Follow the link provided to finalize the signup process.
ro: Acesta a fost penultimul pas. Tot ce mai e de făcut este să dai un singur click pe link-ul din căsuța de e-mail.

source: Please contact us if you do not receive it within a few minutes.
ro: Dacă trec câteva minute fără niciun semn, contactează-ne, este posibil ca o setare de server să blocheze mailurile.

source: Back to Login
ro: Mergi în panoul principal de logare

source: Sign in to your account
ro: Accesează Panoul Tău InvApp

source: Email address
ro: Adresa de email personală

source: Remember me
ro: Păstrează contul conectat 30 zile

source: Forgot password?
ro: Nu îmi amintesc parola

source: New to InvApp?
ro: Prima dată pe aici?

source: Create an account
ro: Durează 2 minute să creezi un cont

source: Sign Up - InvApp
ro: Formular de Creare - InvApp

source: Errors occurred during registration
ro: Sistemul indică un format eronat la înregistrare. Verifică datele de mai sus.

source: Sign up
ro: Vreau Cont!

source: Already have an account?
ro: Contul este deja creat?

source: Confirm Sign In
ro: Verificare conexiune

source: You are about to connect your %(provider)s account.
ro: Începem conectarea punții digitale între contul tău de %(provider)s și InvApp.

source: This will link it to your existing InviteMe account.
ro: Operațiunea asta va face legătura și te va loga mult mai rapid.

source: You are about to sign in using your %(provider)s account.
ro: Autentificare pe cale să se producă automat cu protocolul %(provider)s.

source: Continue
ro: Aprobă și continuă navigarea
