Repository: cristi3lup/wedding_app
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ro

source: Gallery Image
ro: Imagine Galerie

source: Photo Gallery (Max 6 images)
ro: Galerie Foto (Maxim 6 imagini)

source: Guests
ro: Invitați

source: RSVP Status
ro: Stare RSVP

source: Yes
ro: Da

source: No
ro: Nu

source: Assigned Table
ro: Masa Alocată

source: Email Address
ro: Adresa de Email

source: Preview
ro: Previzualizare

source: Current Image Preview
ro: Previzualizare Imagine Curentă

source: Available Plans
ro: Abonamente Disponibile

source: Special Fields
ro: Câmpuri Speciale

source: General Information
ro: Informații Generale

source: Limitations
ro: Limitări

source: Set technical limits for this plan.
ro: Setează limitele tehnice pentru acest plan.

source: Visual & Public
ro: Vizual și Public

source: Legacy Settings
ro: Setări Vechi (Legacy)

source: Value must be less than or equal to %(max)s, please contact event host.
ro: Valoarea trebuie să fie mai mică sau egală cu %(max)s. Te rugăm să contactezi organizatorul.

source: Invalid choice: This guest has not RSVP'd Yes.
ro: Alegere invalidă: Acest invitat nu a confirmat prezența.

source: Invalid choice: This guest has not RSVP'd.
ro: Alegere invalidă: Acest invitat nu a răspuns la invitație încă.

source: Table Name or Number
ro: Numele sau Numărul Mesei

source: Capacity (Number of Seats)
ro: Capacitate (Număr de locuri)

source: Assign Guest
ro: Așează Invitatul

source: To Table
ro: La Masa

source: Not enough capacity at {table_name}. Needs {needed_seats} seat for {guest_name}, but only {available_seats} seat(s) are available.
ro: Capacitate insuficientă la {table_name}. E nevoie de {needed_seats} loc pentru {guest_name}, dar mai este disponibil doar {available_seats} loc.

source: Direct Contact Button
ro: Buton Contact Direct

source: Enable a WhatsApp button on your invitation so guests can message you instantly with questions or to confirm their arrival personally.
ro: Activează un buton de WhatsApp pe invitația ta, astfel încât invitații să îți poată scrie instantaneu pentru întrebări sau pentru a-și confirma prezența personal.

source: WhatsApp Contact (Optional)
ro: Contact WhatsApp (Opțional)

source: WhatsApp Message (Optional)
ro: Mesaj WhatsApp (Opțional)

source: Courtesy Title
ro: Formulă de adresare

source: Guest/Group Name (e.g., 'The Smith Family', 'John Doe')
ro: Nume Invitat/Grup (ex: 'Familia Popescu', 'Ion Popescu')

source: Invitation Language
ro: Limba Invitației

source: Phone Number (Optional)
ro: Număr de Telefon (Opțional)

source: Email Address (Optional)
ro: Adresă de Email (Opțional)

source: Max Number of People Invited (including guest)
ro: Numărul maxim de persoane invitate

source: Enter the total number of people this invitation covers (e.g., 2 for a couple).
ro: Introdu numărul total de persoane acoperit de această invitație (ex: 2 pentru un cuplu).

source: Full name of the primary guest or couple/family name.
ro: Numele complet al invitatului principal sau numele familiei/cuplului.

source: Primary email for the invitation.
ro: Adresa de email principală pentru invitație.

source: A valid email address is required for account confirmation.
ro: Este necesară o adresă de email validă pentru confirmarea contului.

source: An account with this email address already exists.
ro: Există deja un cont înregistrat cu acest email.

source: Not specified
ro: Nespecificat

source: Select guests to assign
ro: Selectează invitații pentru a-i așeza la masă

source: Assign selected guests to
ro: Așează invitații selectați la

source: Not enough capacity at %(table)s. Assigning these guests requires %(needed)d seat(s), but only %(available)d seat(s) are available.
ro: Capacitate insuficientă la %(table)s. Acești invitați au nevoie de %(needed)d locuri, dar sunt disponibile doar %(available)d.

source: I agree to the <a href="{}" target="_blank" class="text-indigo-600 hover:underline">Terms and Conditions</a> and <a href="{}" target="_blank" class="text-indigo-600 hover:underline">Privacy Policy</a>.
ro: Sunt de acord cu <a href="{}" target="_blank" class="text-indigo-600 hover:underline">Termenii și Condițiile</a> și <a href="{}" target="_blank" class="text-indigo-600 hover:underline">Politica de Confidențialitate</a>.

source: Godparent's name
ro: Numele nașilor

source: e.g. Town Hall, Main Church
ro: ex: Primărie, Biserica Sf. Maria

source: Optional details...
ro: Detalii opționale...

source: Tell us what you think (optional)...
ro: Spune-ne părerea ta (opțional)...

source: Hero Background (Landing)
ro: Imagine de fundal (Prima Pagină)

source: Primary Logo
ro: Logo Principal

source: Feature Image 1
ro: Imagine Prezentare Funcționalități 1

source: Feature Image 2
ro: Imagine Prezentare Funcționalități 2

source: Feature Image 3
ro: Imagine Prezentare Funcționalități 3

source: Call to Action Background
ro: Fundal Secțiune Call to Action

source: Partner Promotion (Culori)
ro: Promovare Partener (Culori)

source: Show Watermark
ro: Afișează Watermark (Logo InvApp)

source: Feature Text (RO)
ro: Text Funcționalitate (RO)

source: Feature Text (EN)
ro: Text Funcționalitate (EN)

source: Plan Feature
ro: Funcționalitate Abonament

source: Plan Features
ro: Funcționalități Abonament

source: WhatsApp Number
ro: Număr WhatsApp

source: Instagram URL
ro: Link Instagram

source: Website URL
ro: Link Website

source: Marketing Campaign
ro: Campanie Marketing

source: Marketing Campaigns
ro: Campanii Marketing

source: Wedding
ro: Nuntă

source: Baptism
ro: Botez

source: Image Upload Only
ro: Doar Încărcare Imagine

source: Format: 407XXXXXXXX (no '+' or '0' in front)
ro: Format: 407XXXXXXXX (fără '+' sau '0' în față

source: Default pre-filled message for the guest to send to the host.
ro: Mesaj preconceput pe care invitatul îl trimite gazdei.

source: Our Wedding
ro: Nunta Noastră

source: The limit of 6 photos for this package has been reached.
ro: Ai atins limita maximă de 6 poze pentru acest pachet.

source: Mr.
ro: Dl.

source: Mrs.
ro: Dna.

source: Ms.
ro: Dra.

source: Family
ro: Familia

source: Couple
ro: Cuplul

source: None
ro: Fără adresare

source: The {name} Family
ro: Familia {name}

source: The {name} Couple
ro: Cuplul {name}

source: On Paper
ro: Pe Hârtie

source: Automatic (Guest)
ro: Automat (Invitat)

source: Undecided
ro: Nehotărât

source: Attending
ro: Participă

source: Not Attending
ro: Nu participă

source: RSVP for {name} - {status}
ro: Confirmare (RSVP) pentru {name} - {status}

source: Unknown Guest
ro: Invitat Necunoscut

source: Unknown Table
ro: Masă Necunoscută

source: {guest} -> {table} for {event}
ro: {guest} este așezat la {table} pentru {event}

source: {guest} -> {table} (No Event Assigned)
ro: {guest} -> {table} (Fără eveniment)

source: Civil Ceremony
ro: Cununia Civilă

source: Religious Ceremony
ro: Cununia Religioasă / Slujba de Botez

source: Reception
ro: Primirea Invitaților

source: Party
ro: Petrecerea

source: Photoshoot
ro: Ședință Foto

source: Other
ro: Altceva

source: Time
ro: Ora

source: Schedule Item
ro: Element de Program

source: Schedule Items
ro: Elemente Program

source: FAQ Item
ro: Întrebare Frecventă

source: Customer Review
ro: Recenzie Client

source: Customer Reviews
ro: Recenzii Clienți

source: Crafted with Love
ro: Creat cu Dragoste

source: About Section Configuration
ro: Configurare Secțiune 'Despre'

source: About Section Configurations
ro: Configurări Secțiune 'Despre'

source: Generate Bulk Vouchers
ro: Generare Bulk Vouchere

source: Complete the parameters below to generate a new set of vouchers. Upon completion, a CSV file will be downloaded automatically.
ro: Completează parametrii de mai jos pentru a genera un set nou de vouchere. La finalizarea procesului, un fișier CSV va fi descărcat automat.

source: Number of vouchers:
ro: Număr de vouchere:

source: How many unique codes you want to generate (Max 1000).
ro: Câte coduri unice dorești să generezi (Max 1000).

source: Campaign Name:
ro: Nume Campanie:

source: e.g. Wedding_Fair_March_2026
ro: Ex: Targ_Nunti_Martie_2026

source: Used to identify the source of these vouchers in statistics.
ro: Folosit pentru a identifica sursa acestor vouchere în statistici.

source: Valid From:
ro: Valabil de la:

source: Date when the voucher becomes active. Leave empty for 'Now'.
ro: Data de la care voucherul devine activ. Lasă gol pentru 'Acum'.

source: Days Valid:
ro: Zile Valabilitate:

source: How many days until these vouchers expire from the moment of generation?
ro: În câte zile vor expira aceste vouchere din momentul generării?

source: Discount %%:
ro: Reducere %%:

source: Applied discount percentage (100 = Free).
ro: Procentul de reducere aplicat (100 = Gratuit).

source: Applicable Plans:
ro: Planuri Aplicabile:

source: If you don't select any plan, the voucher will be valid for ALL plans.
ro: Dacă nu selectezi niciun plan, voucherul va fi valabil pentru TOATE planurile.

source: Custom Message:
ro: Mesaj Personalizat:

source: Write your custom WhatsApp message here...
ro: Scrie mesajul tău personalizat pentru WhatsApp aici...

source: This message will be used for WhatsApp sharing. The activation link will be automatically added at the end.
ro: Acest mesaj va fi folosit pentru distribuirea pe WhatsApp. Link-ul de activare va fi adăugat automat la final.

source: Generate and Download CSV
ro: Generează și Descarcă CSV

source: Cancel
ro: Anulează

source: Digital Wedding Invitations & Online RSVP Platform | InvApp
ro: Invitații Digitale Nuntă și Botez | Platformă RSVP Online | InvApp

source: Create premium digital wedding invitations with real-time RSVP confirmations. Manage your guests intelligently and stress-free. Try for free!
ro: Creează invitații digitale premium cu confirmare RSVP în timp real. Gestionează lista de invitați la nuntă sau botez inteligent și fără stres. Încearcă gratuit!

source: Create premium digital wedding invitations with real-time RSVP confirmations.
ro: Creează invitații digitale de excepție pentru nunta ta, cu confirmări RSVP.

source: Premium digital invitations for special events.
ro: Invitații digitale premium pentru evenimentele tale de suflet.

source: Accept
ro: Acceptă

source: Rate Us
ro: Oferă-ne o recenzie

source: Sign In
ro: Intră în Cont

source: Sign Up
ro: Înregistrare

source: Appearance
ro: Aspect

source: You're Invited
ro: Ești Invitat

source: Online Invitation
ro: Invitație Online

source: We cordially invite you to our event! Click for details and confirmation.
ro: Te invităm cu drag la evenimentul nostru! Deschide pentru detalii și confirmare.

source: This is a free preview.
ro: Acesta este un preview (varianta gratuită).

source: Activate Premium Plan to remove the watermark.
ro: Activează un plan Premium pentru a elimina logoul nostru.

source: Dashboard
ro: Panou

source: Your Dashboard
ro: Contul Meu

source: Here are all the events you are currently planning.
ro: Aici găsești toate evenimentele pe care le planifici.

source: events used
ro: evenimente folosite

source: Create New Event
ro: Creează un Eveniment Nou

source: Upgrade Plan
ro: Treci la Premium

source: Plan Limit Reached
ro: Limită Abonament Atinsă

source: You have reached the maximum number of events allowed on your current plan. Please upgrade to create more events.
ro: Ai atins numărul maxim de evenimente permise de planul tău gratuit. Treci la un plan superior pentru a crea mai multe.

source: Confirmed
ro: Confirmați

source: Edit Details
ro: Editează Detaliile

source: Edit
ro: Editează

source: View
ro: Vezi Invitația

source: Open in new tab
ro: Deschide într-un tab nou

source: Delete
ro: Șterge

source: No events found
ro: Nu ai creat niciun eveniment încă

source: Get started by creating your first event. It's simple and the results will be amazing.
ro: Începe prin a crea primul tău eveniment. E simplu, iar rezultatele vor fi exact cum ai visat.

source: + Create New Event
ro: + Creează Eveniment Nou

source: Invitation Preview
ro: Previzualizare Invitație

source: Draft Mode
ro: Mod Ciornă

source: Open in new window
ro: Deschide într-o fereastră nouă

source: Generating Preview...
ro: Generăm Previzualizarea...

source: Manage your active event planning journeys.
ro: Gestionează călătoria ta de planificare a evenimentelor.

source: Create Event
ro: Creare Eveniment

source: Refine Your Event
ro: Personalizează Evenimentul

source: Synced
ro: Sincronizat

source: Submission Blocked: Action Required
ro: Salvare Blocată: Acțiune Necesară

source: Godparents
ro: Nașii

source: Hold on!
ro: Stai puțin!

source: Occasion
ro: Eveniment

source: Internal Title
ro: Titlu Intern (doar pentru tine)

source: Event Date
ro: Data Evenimentului

source: Ceremony Map Link
ro: Link Hartă Biserică/Ceremonie

source: To embed: Google Maps -> Share -> Embed a map -> Copy ONLY the link inside the src attribute.
ro: Pentru inserare: Google Maps -> Trimite -> Inserare hartă -> Copiază DOAR link-ul din interiorul atributului src.

source: Party Map Link
ro: Link Hartă Petrecere

source: Bride
ro: Mireasa

source: Groom
ro: Mirele

source: Bride's Parents
ro: Părinții Miresei

source: Groom's Parents
ro: Părinții Mirelui

source: Child Name
ro: Nume Copil

source: Parents
ro: Părinți

source: Invitation Wording
ro: Textul Invitației

source: Upload your design
ro: Încarcă design-ul tău

source: Ceremony
ro: Cununia / Botezul

source: Venue Name
ro: Numele Locației / Restaurant

source: Refresh Sync
ro: Reîmprospătează Sincronizarea

source: Next
ro: Pasul Următor

source: Publishing...
ro: Se publică...

source: Publish Invite
ro: Publică Invitația

source: Theme Style
ro: Stilul Temei

source: Core Narrative & Maps
ro: Povestea Noastră și Locații

source: Upload & Publish
ro: Încărcare și Publicare

source: Core Narrative
ro: Povestea Noastră

source: Where and When
ro: Unde și Când

source: Timeline Details
ro: Detaliile Programului

source: Visual Assets
ro: Elemente Vizuale

source: Frequently Asked Questions
ro: Întrebări Frecvente

source: Have questions? Find answers to the most common questions about the InvApp platform.
ro: Ai întrebări? Găsește răspunsuri la cele mai comune curiozități despre platforma InvApp.

source: No frequently asked questions added yet.
ro: Încă nu au fost adăugate întrebări frecvente.

source: Didn't find the answer you were looking for?
ro: Nu ai găsit răspunsul pe care îl căutai?

source: Contact support team
ro: Contactează echipa de suport

source: Share your feedback
ro: Lasă-ne părerea ta

source: Your opinion helps us improve the platform.
ro: Opinia ta ne ajută enorm să construim un produs mai bun.

source: Posting as
ro: Postezi ca

source: Message (Optional)
ro: Mesaj (Opțional)

source: Submit Feedback
ro: Trimite Feedback

source: Confirm Delete Guest
ro: Confirmare Ștergere Invitat

source: Delete Guest
ro: Șterge Invitatul

source: Are you sure you want to delete the guest
ro: Sigur vrei să ștergi invitatul

source: This action cannot be undone and will also delete their RSVP response and any table assignment.
ro: Această acțiune este ireversibilă și va șterge automat confirmarea RSVP și așezarea la masă.

source: Yes, Delete Guest
ro: Da, șterge invitatul

source: Edit Guest
ro: Editează Invitat

source: Add New Guest
ro: Adaugă Invitat Nou

source: Manage details for
ro: Gestionează detaliile pentru

source: Back to Guest List
ro: Înapoi la Lista de Invitați

source: There were errors with your submission
ro: A apărut o eroare la salvare

source: Guest Identity
ro: Identitate Invitat

source: Basic information about who you are inviting. Use 'Family' or 'Couple' titles to group people together.
ro: Informații de bază. Folosește 'Familia' sau 'Cuplul' pentru a invita mai multe persoane pe același link.

source: Choose how you want to send this invitation and provide the contact details.
ro: Alege modul în care dorești să trimiți această invitație și furnizează datele de contact.

source: Attendance Status
ro: Starea Prezenței

source: Use this section to manually set or override the attendance status for this guest.
ro: Folosește această secțiune pentru a seta manual sau a modifica starea prezenței pentru acest invitat.

source: Are you sure you want to permanently delete this guest?
ro: Ești sigur că vrei să ștergi permanent acest invitat?

source: Save Changes
ro: Salvează Modificările

source: Add Guest
ro: Adaugă Invitat

source: Invitation for
ro: Invitație pentru

source: Hello
ro: Salutare

source: When:
ro: Când:

source: at
ro: la ora

source: Where:
ro: Unde:

source: Address:
ro: Adresa:

source: Add to Google Calendar
ro: Adaugă în Google Calendar

source: Location Map
ro: Harta Locației

source: Your RSVP
ro: Confirmarea Ta (RSVP)

source: Please respond by [Your RSVP Deadline]. Your invitation includes up to
ro: Te rugăm să confirmi prezența. Invitația este valabilă pentru maxim

source: attendee(s).
ro: persoane.

source: Submit RSVP
ro: Trimite Confirmarea

source: Guest List
ro: Lista de Invitați

source: Download Template
ro: Descarcă Model Excel

source: Pending
ro: În așteptare

source: Romanian
ro: Limba Română

source: English
ro: Limba Engleză

source: Meal:
ro: Meniu:

source: Sent Via
ro: Trimis prin

source: RSVP
ro: Confirmă Prezența

source: Details
ro: Detalii

source: Actions
ro: Acțiuni

source: Copy Link
ro: Copiază Linkul pe WhatsApp

source: Import Guests
ro: Importă Invitați (Excel)

source: Our latest reviews
ro: Ultimele noastre recenzii

source: Trusted by happy couples
ro: Recomandat de sute de cupluri fericite

source: An excellent experience!
ro: O experiență de nota 10!

source: Maybe Later
ro: Poate mai târziu

source: Baby Name
ro: Nume Bebe

source: Together with my parents
ro: Alături de mami și tati

source: Alongside my godparents
ro: Din brațele nașilor mei

source: We are delighted to invite you to the holy baptism
ro: Suntem nerăbdători să vă invităm la sfântul botez

source: My baptism will take place at
ro: Taina Botezului va avea loc la

source: Church Name
ro: Numele Bisericii

source: starting at
ro: începând cu ora

source: View Map
ro: Navighează pe Hartă

source: We will then celebrate together at
ro: Vom sărbători apoi împreună la

source: We look forward to seeing you!
ro: Vă așteptăm cu drag!

source: Confirm Attendance
ro: Confirmă Prezența

source: Confirmation
ro: Confirmare

source: Please complete the form below.
ro: Te rugăm să completezi formularul de mai jos pentru a ne anunța dacă vii.

source: Will you attend?
ro: Vei participa?

source: Number of guests
ro: Număr persoane

source: Max %(max)s guests
ro: Maxim %(max)s persoane

source: Dietary Requirements
ro: Preferințe Culinare (Alergii/Vegetarian)

source: Message for parents
ro: Mesaj pentru părinți

source: Send Response
ro: Trimite Răspunsul

source: Save the Date
ro: Rezervă Data

source: Together with our parents
ro: Din dragostea părinților noștri

source: Together with our godparents
ro: Cu binecuvântarea nașilor

source: We invite you to celebrate our wedding
ro: Vă invităm cu căldură să ne fiți alături în ziua nunții noastre

source: We've chosen to walk life's path together and would be honored to have you by our side as we exchange our vows.
ro: Am ales să pășim pe același drum și am fi onorați să ne fiți alături la cel mai frumos 'Da' din viața noastră.

source: Thank you
ro: Vă mulțumim

source: Dear %(name)s Family,
ro: Dragă Familie %(name)s,

source: Dear %(name)s Couple,
ro: Dragi %(name)s,

source: Dear %(name)s,
ro: Dragă %(name)s,

source: Days
ro: Zile

source: Hours
ro: Ore

source: Ceremony Location Name
ro: Locație Cununie Religioasă

source: The Celebration
ro: Sărbătoarea

source: For
ro: Pentru

source: Number of Guests
ro: Câte persoane participați?

source: Special Menu / Allergies
ro: Meniu Special / Alergii

source: e.g. Vegetarian, Gluten-free...
ro: ex: 1 Meniu Vegetarian, 1 Meniu Copil...

source: Message for the Couple
ro: Un mesaj pentru Miri

source: Your wishes...
ro: Gândurile tale bune...

source: This will override your previous response. Continue?
ro: Acest răspuns va suprascrie confirmarea ta anterioară. Continui?

source: Open Menu
ro: Deschide Meniul

source: Events
ro: Locații

source: Together with the Stars
ro: Un cuplu scris în stele

source: Until the alignment of the stars
ro: Până ne vom spune DA

source: Ceremony Location
ro: Locația Ceremoniei Religioase

source: View Ceremony
ro: Navighează spre Biserică

source: View Party
ro: Navighează spre Petrecere

source: Constellation Timeline
ro: Programul Evenimentului

source: Please respond by
ro: Te rugăm să confirmi prezența până pe

source: Max
ro: Maxim

source: Special Menu
ro: Meniu Special

source: Leave a message
ro: Lasă-ne un mesaj

source: Leave a note for the couple...
ro: Scrie câteva rânduri pentru miri...

source: This will override manual updates. Continue?
ro: Asta va modifica datele salvate anterior. Continui?

source: We are getting married
ro: Ne căsătorim

source: Two lives, two hearts joined together in friendship united forever in love.
ro: Două inimi, un singur drum, uniți pentru totdeauna în iubire.

source: View location
ro: Deschide locația în Maps

source: Message
ro: Mesaj

source: Your message...
ro: Mesajul tău...

source: You have already submitted an RSVP. Are you sure you want to change your response?
ro: Ai confirmat deja prezența. Sigur dorești să modifici răspunsul?

source: Tap to Open
ro: Apasă pentru a deschide

source: You are cordially invited to the wedding of
ro: Ești invitat cu drag la nunta noastră,

source: The Day
ro: Ziua Cea Mare

source: Kindly respond by
ro: Vă rugăm să ne răspundeți până la data de

source: Will you be joining us?
ro: Ne veți onora cu prezența?

source: Max: %(max)s
ro: Maxim: %(max)s

source: You're Invited!
ro: Ești Invitat!

source: Invitation image will be displayed here.
ro: Imaginea invitației va fi afișată aici (Preview).

source: Kindly Respond
ro: Așteptăm cu drag răspunsul

source: This invitation is for:
ro: Această invitație este adresată:

source: Value must be less than or equal to
ro: Valoarea trebuie să fie mai mică sau egală cu

source: please contact event host
ro: te rugăm să contactezi mirii dacă sunt modificări

source: Maximum allowed: %(max)s
ro: Maxim locuri alocate: %(max)s

source: Meal Preferences / Allergies
ro: Preferințe Culinare / Alergii

source: Vegetarian, Gluten-free, etc.
ro: ex: Meniu Vegetarian, Fără Gluten etc.

source: Message for the hosts
ro: Un gând pentru gazde

source: We are so happy for you...
ro: Suntem atât de fericiți pentru voi...

source: RSVP is disabled in preview mode.
ro: Formularul RSVP este dezactivat în modul Preview.

source: Send RSVP
ro: Trimite Confirmarea RSVP

source: The event host has manually updated your attendance. Submitting this form will override that update. Do you want to continue?
ro: Mirii ți-au actualizat deja prezența manual. Dacă trimiți formularul acum, vei suprascrie datele lor. Continui?

source: Hrs
ro: Ore

source: Maps
ro: Deschide Harta

source: Timeline
ro: Program Ziua Nunții

source: RSVP Now
ro: Confirmă Acum

source: Dietary Restrictions
ro: Restricții Alimentare / Meniu

source: This will override the manual update. Continue?
ro: Acest răspuns va suprascrie prezența marcată anterior. Continui?

source: are getting married
ro: își unesc destinele

source: Until the big day
ro: Până la ziua cea mare

source: Minutes
ro: Minute

source: Seconds
ro: Secunde

source: Invite for The %(name)s Family
ro: Invitație adresată Familiei %(name)s

source: Invite for The %(name)s Couple
ro: Invitație adresată cuplului %(name)s

source: Invite for %(name)s
ro: Invitație adresată pentru %(name)s

source: Save The Date
ro: Rezervă Data în Calendar

source: Important Info
ro: Informații Utile

source: R.S.V.P.
ro: Confirmare (R.S.V.P.)

source: Please respond by the date specified
ro: Te rugăm să confirmi prezența din timp

source: Send Confirmation
ro: Trimite Confirmarea
