Repository: cristi3lup/wedding_app
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ro

source: With Love,
ro: Cu prețuire,

source: Couple Photo
ro: Fotografie Cuplu

source: Together With Their Families
ro: Împreună cu familiile lor,

source: invite you to celebrate their wedding
ro: vă invită cu bucurie să sărbătoriți alături de ei ziua nunții

source: Order of Events
ro: Desfășurarea Evenimentului

source: Venue Details
ro: Detalii Locație

source: Both the ceremony and reception will be held at:
ro: Evenimentul va avea loc la:

source: Get Directions
ro: Preia Traseul (Waze/Maps)

source: Other Information
ro: Alte Informații

source: Dress Code
ro: Cod Vestimentar

source: We kindly request formal attire. (e.g., suits and cocktail dresses).
ro: Vă rugăm să adoptați o ținută formală/elegantă.

source: Kindly RSVP
ro: Vă rugăm să confirmați prezența

source: Please let us know if you can join our celebration by November 1st.
ro: Pentru o mai bună organizare, te rugăm să confirmi prezența cât mai curând.

source: We invite you to be with us
ro: Vă invităm să ne fiți alături

source: and
ro: și

source: With the blessing of parents
ro: Cu binecuvântarea părinților

source: Together with godparents
ro: Alături de nașii noștri spirituali

source: Dear The %(name)s Family
ro: Dragă Familie %(name)s,

source: Dear The %(name)s Couple
ro: Dragi %(name)s,

source: Dear %(name)s
ro: Dragă %(name)s,

source: The Party
ro: Petrecerea

source: Please confirm your attendance
ro: Vă rugăm să vă confirmați prezența

source: We can't wait to see you!
ro: Abia așteptăm să ne distrăm împreună!

source: Holy Baptism
ro: Sfântul Botez

source: together with the parents
ro: alături de iubiții mei părinți

source: and the godparents
ro: și minunații mei nași

source: We joyfully invite you to the baptism that will take place on
ro: Vă invităm cu imensă bucurie la botezul ce va avea loc pe

source: Religious Service
ro: Slujba Religioasă

source: Party Location
ro: Locația Petrecerii

source: View Directions
ro: Deschide pe GPS

source: Please confirm your presence.
ro: Te rugăm să ne ajuți cu confirmarea prezenței.

source: Invitation for:
ro: Invitație nominală pentru:

source: Menu Preferences / Allergies
ro: Preferințe Meniu (ex. Vegetarian/Copil)

source: You are joyfully invited to
ro: Sunteți invitați cu mare bucurie la zborul către

source: RSVP TO WEDDING
ro: CONFIRMĂ PREZENȚA (RSVP)

source: HOME
ro: ACASĂ

source: VENUE
ro: LOCAȚIE

source: Type: Wedding
ro: Zbor: Cursa Vieții

source: Code:
ro: Cod:

source: Pass No:
ro: Poarta:

source: Passenger
ro: Pasager Principal

source: Date
ro: Data

source: Map
ro: Hartă

source: Scan to Details
ro: Scanează

source: Click to RSVP
ro: Apasă pentru Confirmare

source: Together with their godparents
ro: Alături de nașii lor

source: CONFIRM ATTENDANCE
ro: CONFIRMĂ PREZENȚA

source: Premium Digital Invitations for Weddings & Baptisms - InvApp
ro: Invitații Digitale Premium pentru Nuntă și Botez | InvApp Romania

source: Create elegant digital invitations, manage guest lists, and receive real-time RSVP confirmations. Premium designs for weddings and baptisms with InvApp.
ro: Platformă modernă pentru invitații digitale: Gestionează lista de invitați, așează mesele și primește confirmări RSVP automatizate. Alege InvApp!

source: The modern way to invite your guests. Elegant designs, RSVP tracking, and guest management in one place.
ro: Cel mai modern mod de a-ți chema invitații. Design-uri elegante, sistem inteligent de RSVP și organizarea meselor, totul într-o singură aplicație.

source: Features
ro: Funcții

source: Designs
ro: Modele

source: About
ro: Despre

source: Pricing
ro: Prețuri

source: Styling
ro: Decor

source: Styling Partner
ro: Partener Decor

source: Special Offer by
ro: Ofertă specială de

source: Hi! I'm interested in the %(name)s offer.
ro: Bună! Sunt interesat de oferta %(name)s.

source: I want the Offer
ro: Vreau Oferta

source: Offer
ro: Oferta

source: Get the Offer
ro: Vreau Oferta

source: How it works
ro: Cum funcționează

source: Why InvApp?
ro: De ce să folosești InvApp?

source: Everything you need for your event
ro: Organizatorul digital din buzunarul tău

source: We provide powerful tools to make your wedding planning stress-free and enjoyable.
ro: Platforma noastră automatizează munca obositoare, ca tu să te bucuri de partea frumoasă a organizării.

source: Guest Management
ro: Management Invitați

source: Easily manage your guest list, track RSVPs, and organize details in one place.
ro: Adaugi invitații din Excel sau manual, îi grupezi pe familii și știi mereu cine vine și cine nu.

source: Digital RSVP
ro: Confirmări (RSVP) Inteligente

source: Receive instant confirmations, meal preferences, and more.
ro: Trimiți link-ul pe WhatsApp, iar invitații confirmă direct de pe telefon preferințele de meniu.

source: Table Planning
ro: Așezare Mese Drag&Drop

source: Organize seating charts effortlessly with our intuitive table assignment tool.
ro: Organizează așezarea la mese intuitiv, alocă invitații confirmați și exportă tabelul pentru restaurant.

source: Multi-Language
ro: Invitații Multi-Lingve

source: Create invitations in multiple languages for your international guests.
ro: Aveți invitați din străinătate? Nimic mai simplu. Invitațiile se pot adapta limbii invitatului tău.

source: Collection
ro: Colecția Noastră

source: Choose your style
ro: Alege design-ul perfect pentru voi

source: Select from our collection of designs.
ro: Alege dintre temele grafice create cu grijă pentru Nuntă și Botez.

source: Multi-language Supported
ro: Suportă Mai Multe Limbi

source: Multi-lang
ro: Multi-limbă

source: No designs are available right now. Please check back soon!
ro: Nu avem design-uri publicate momentan. Lucrăm la asta!

source: ... more beautiful designs coming soon!
ro: ... pregătim zeci de alte design-uri minunate!

source: We believe the magic of an event begins with the invitation. Our mission is to empower you with an intuitive and inspiring tool to craft breathtaking invitations that spark excitement and connection. We're here to ensure every part of your journey, especially managing your guest list, is as joyful and effortless as the celebration itself.
ro: Credem că magia oricărui eveniment reusit începe încă de la invitație. Misiunea platformei noastre, creată special pentru piața din România, este să îți ofere un tool intuitiv, fără erori tehnice, cu care să economisești timp, bani și nervi. Scapă de tabele încurcate, agende pierdute și răspunsuri incerte.

source: Choose a Plan That's Right For You
ro: Alege pachetul perfect pentru evenimentul tău

source: Most Popular
ro: Cel mai popular

source: event
ro: eveniment

source: Up to
ro: Până la

source: Start for free
ro: Începe Gratuit

source: Get Started
ro: Alege Abonamentul

source: Roadmap
ro: Ce urmează pe Platformă?

source: Coming Soon
ro: În Curând

source: We are working on exciting new features. Click on any feature to learn more.
ro: Dezvoltăm constant funcționalități noi pentru a vă ușura viața. Iată la ce lucrăm acum:

source: IN PROGRESS
ro: ÎN DEZVOLTARE

source: Got it!
ro: Am înțeles!

source: Still have questions?
ro: Mai ai curiozități?

source: Browse our Frequently Asked Questions to find out more about how to create the perfect invitation.
ro: Răsfoiește secțiunea noastră de Întrebări Frecvente pentru a afla cum să obții maximum de la InvApp.

source: Visit FAQ Page
ro: Vezi Toate Întrebările

source: Our Trusted Partner
ro: Recomandarea noastră

source: Exceptional Floral Design & Styling for Your Event
ro: Design Floral Excepțional & Organizare Evenimente

source: With over 10 years of experience
ro: Cu experiență vastă

source: in transforming fairytale locations, our exclusive partner brings your vision to reality.
ro: în transformarea locațiilor în povești de neuitat, partenerul nostru exclusiv îți aduce viziunea la realitate.

source: We believe that a perfect digital invitation deserves a matching decor. Every floral detail is created to reflect the elegance and unique personality of the couple.
ro: Credem cu tărie că o invitație digitală premium merită un decor floral pe măsură. Orice detaliu spune o poveste.

source: Follow us on Instagram
ro: Urmărește-i pe Instagram

source: Facebook Portfolio
ro: Portofoliu Facebook

source: Crafting elegant digital experiences for life's most beautiful moments. Simple, digital, and stress-free event planning for modern couples.
ro: Construim experiențe digitale elegante pentru momentele voastre speciale. Planificare digitală, simplă și eficientă pentru cuplurile moderne din România.

source: Platform
ro: Platformă

source: Invitation Designs
ro: Teme Invitații

source: Pricing Plans
ro: Pachete Preț

source: User Dashboard
ro: Conectare la Cont

source: Support
ro: Suport Clienti

source: Help Center & FAQ
ro: Întrebări Frecvente

source: Terms of Service
ro: Termeni și Condiții

source: Privacy Policy
ro: Politica de Confidențialitate

source: Creative Partner
ro: Partener Creativ

source: Looking for premium floral design and event styling?
ro: Cauți decoruri florale premium și organizare completă pentru nuntă?

source: All rights reserved.
ro: Toate drepturile rezervate.

source: Terms
ro: Termeni

source: Privacy
ro: Confidențialitate

source: Handcrafted with passion in Romania
ro: Dezvoltat cu pasiune în România, pentru români.

source: EXPIRED
ro: EXPIRAT

source: The wedding event details haven't been added to the system yet. Please check back later or contact the hosts.
ro: Sistemul nu afișează încă detaliile acestui eveniment. Te rugăm să verifici mai târziu sau să iei legătura cu mirii/părinții.

source: Last updated: October 20, 2025
ro: Ultima actualizare: 20 Octombrie 2025

source: Introduction
ro: Introducere

source: This Privacy Policy describes how [Your Company Name] ("we", "us", or "our") collects, uses, and discloses your information in connection with your use of our website and services (collectively, the "Service").
ro: Această Politică de Confidențialitate descrie cum colectăm, folosim și protejăm informațiile tale în legătură cu platforma InvApp.

source: Information We Collect
ro: Informații pe care le colectăm

source: User Data:
ro: Datele Utilizatorului:

source: We collect personal information you provide when you register for an account, such as your name, email address, and payment information.
ro: Colectăm informații la înregistrare: nume, adresă de email, setări ale evenimentului și date de facturare.

source: Guest Data:
ro: Datele Invitaților tăi:

source: We process personal information about your guests that you provide to us, including their names, email addresses, and phone numbers. We process this data on your behalf to provide the Service's core functionalities.
ro: Pentru buna funcționare, tu ca Utilizator introduci datele invitaților (nume, uneori email/telefon). Le procesăm strict în numele tău pentru trimiterea invitațiilor digitale și funcționalitatea platformei.

source: How We Use Your Information
ro: Cum folosim informațiile

source: We use the information we collect to provide, maintain, and improve our Service, process transactions, and communicate with you. We use the Guest Data you provide solely to send invitations, track RSVPs, and provide other event management features on your behalf.
ro: Folosim aceste date strict pentru a opera platforma InvApp, a securiza plățile Stripe și a facilita fluxul de confirmări RSVP. Datele invitaților tăi nu sunt și nu vor fi niciodată vândute sau folosite pentru marketing!

source: Data Processing and GDPR
ro: Conformitate GDPR

source: As a company operating in Romania, we are compliant with the General Data Protection Regulation (GDPR). When you upload your guests' data, you are the "Data Controller," and we act as the "Data Processor." It is your responsibility as the Data Controller to ensure you have a legal basis (such as consent) for processing your guests' data.
ro: Operând din România, respectăm GDPR. Atunci când încarci lista ta, tu ești 'Operatorul de date', iar noi suntem 'Procesatorul'. Îți asumi că persoanele pe care le inviți îți sunt cunoscute.

source: Your Rights
ro: Drepturile Tale

source: You have the right to access, update, or delete your personal information at any time by logging into your account or contacting us. You also have the right to manage and delete the personal data of your guests.
ro: Poți solicita oricând ștergerea completă a contului, a evenimentului și a tuturor datelor despre invitați direct din Panoul de Control.

source: Contact Us
ro: Contact

source: If you have any questions about this Privacy Policy, please contact us at
ro: Pentru orice lămurire despre protecția datelor, scrie-ne la

source: Thank You!
ro: Mulțumim pentru Confirmare!

source: Thank You,
ro: Îți mulțumim,

source: We look forward to celebrating with you at the wedding of
ro: Așteptăm cu nerăbdare să ne bucurăm împreună la evenimentul organizat de

source: Stay Updated
ro: Rămâi la Curent

source: Optionally, provide your contact details below to receive important updates about the event.
ro: Opțional: Dacă vrei, lasă-ți datele mai jos. Mirii vor putea astfel să-ți trimită un mesaj rapid dacă intervin modificări legate de locație/oră.

source: Phone Number
ro: Număr de Telefon

source: Save Contact Info
ro: Salvează Datele de Contact

source: Need to change your RSVP?
ro: Vrei să modifici confirmarea prezenței?

source: View Digital Invitation
ro: Întoarce-te la Invitația Digitală

source: Powered by InvApp
ro: Generat prin tehnologia InvApp România

source: Table List
ro: Așezare Mese

source: Assign Guests
ro: Asignează Invitați la Mese

source: Table Assignments
ro: Așezare la Mese / Seating

source: Seating plan for:
ro: Planificare mese pentru:

source: Export to CSV
ro: Descarcă Excel (CSV pentru Restaurant)

source: Unassigned Guests
ro: Invitați Neașezați

source: All attending guests have been assigned!
ro: Felicitări! Toți invitații confirmați sunt deja așezați la mese!

source: Assign Guest(s)
ro: Așează la Masă

source: Seating Plan
ro: Planul Mesei

source: Capacity:
ro: Capacitate:

source: No guests assigned yet.
ro: Încă nu ai așezat pe nimeni aici.

source: No tables have been created for this event yet.
ro: Încă nu ai adăugat mese (ex. Masa 1, Masa Mirilor).

source: Create tables now
ro: Creează o masă nouă acum

source: Confirm Delete Table
ro: Confirmare Ștergere Masă

source: Delete Table
ro: Șterge Masa

source: Are you sure you want to delete the table
ro: Ești sigur că dorești să ștergi masa:

source: This action cannot be undone. Any guests assigned to this table will become unassigned.
ro: Odată ștearsă, invitații de la această masă se vor întoarce în lista de persoane neașezate.

source: Yes, Delete
ro: Da, Șterge Masa

source: Edit Table:
ro: Editează Masa:

source: Add New Table
ro: Adaugă o Masă Nouă

source: Edit Table
ro: Editează Masa

source: For event:
ro: Pentru evenimentul:

source: Back to Table List
ro: Înapoi la Lista de Mese

source: Add Table
ro: Adaugă Masa

source: Delete this table
ro: Șterge definitiv această masă

source: Managing tables for:
ro: Gestionezi mesele pentru:

source: You haven't created any tables for this event yet.
ro: Meniul de Seating: Creează prima masă pentru a începe organizarea sălii.

source: Create Your First Table
ro: + Creează Prima Masă

source: Terms and Conditions
ro: Termeni și Condiții de Utilizare

source: Agreement to Terms
ro: Acordul privind Termenii de Utilizare

source: By creating an account and using the InvApp service ("Service"), you agree to be bound by these Terms and Conditions. If you disagree with any part of the terms, then you may not access the Service.
ro: Prin crearea contului InvApp, ești de acord cu regulile și termenii noștri de bun-simț pentru utilizarea soft-ului.

source: User Accounts
ro: Contul de Utilizator

source: When you create an account with us, you must provide us with information that is accurate, complete, and current at all times. Failure to do so constitutes a breach of the Terms, which may result in immediate termination of your account on our Service.
ro: Te rugăm să oferi date valide, în special adresa ta de email, deoarece acolo vei primi notificările importante despre evenimentul tău.

source: User and Guest Data
ro: Datele Utilizatorului și Invitaților

source: You are solely responsible for the personal data of your guests that you upload to our Service.
ro: Tu ești responsabil pentru corectitudinea datelor personale încărcate (lista ta de invitați).

source: This includes names, email addresses, and phone numbers. You represent and warrant that you have obtained all necessary consents from your guests to collect, use, and share their data within our Service for the purpose of sending invitations and managing your event.
ro: Garantezi că ai acceptul invitaților pentru a le procesa temporar numele/telefonul în vederea trimiterii invitațiilor și a organizării evenimentului.

source: Our Service will only use this guest data to provide the functionalities of the app, such as sending invitation links and managing RSVP responses. We will not use guest data for any other purpose.
ro: REPETĂM: Noi NU preluăm, NU vindem și NU stocăm abuziv datele invitaților tăi. Le folosim doar algoritmic pentru confirmările RSVP din aplicație.

source: Payments and Plans
ro: Plăți și Abonamente

source: Some parts of the Service are billed on a one-time or subscription basis ("Paid Plans"). You will be billed in advance for the Paid Plans. All payments are handled by our third-party payment processor, Stripe.
ro: Utilizarea Premium a platformei presupune plata unui pachet (one-time sau abonament). Tranzacțiile sunt 100 % securizate și procesate exclusiv de Stripe.

source: Limitation of Liability
ro: Limitarea Răspunderii

source: In no event shall [Your Company Name], nor its directors, employees, partners, agents, suppliers, or affiliates, be liable for any indirect, incidental, special, consequential or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses, resulting from your access to or use of or inability to access or use the Service.
ro: Platforma este furnizată 'așa cum este' (as is). Ne străduim să avem uptime de 99.9%, însă nu suntem răspunzători pentru eventuale erori de terță parte sau întreruperi scurte ale serviciilor de internet.

source: Governing Law
ro: Legislație Aplicabilă

source: These Terms shall be governed and construed in accordance with the laws of Romania, without regard to its conflict of law provisions.
ro: Acești termeni intră sub incidența și reglementările legilor de pe teritoriul României.

source: If you have any questions about these Terms, please contact us at
ro: Dacă ai întrebări comerciale, te rugăm să ne scrii la adresa

source: Termination and Account Abuse
ro: Stergerea Contului și Abuz

source: We may terminate or suspend your account immediately, without prior notice or liability, for any reason whatsoever, including without limitation if you breach the Terms.
ro: Ne rezervăm dreptul de a dezactiva conturile care încearcă să genereze spam sau atacuri cibernetice.

source: Abusing the Free Plan by repeatedly editing a single event to represent multiple, distinct events (e.g., changing a "Wedding" to a "Baptism") is a direct violation of these Terms and will result in immediate account termination.
ro: Folosirea abuzivă a pachetului Gratuit, cum ar fi re-editarea aceluiași eveniment pentru a genera link-uri complet noi pentru alte evenimente (schimbând Nunta în Botezul altcuiva), poate rezulta în blocarea automată a contului.

source: Upgrade Your Plan
ro: Fă Upgrade la Abonament

source: Upgrade to
ro: Deblochează pachetul

source: We're excited to have you on board!
ro: Suntem încântați să participăm digital la organizarea evenimentului tău!

source: Pay Instantly with Card
ro: Plătește în Siguranță cu Cardul (Stripe)

source: Simple Process:
ro: Proces Simplu:

source: Redirect to Stripe secure portal.
ro: Redirecționare către portalul securizat Stripe.

source: Enter your card details safely.
ro: Introduci datele cardului în siguranță.

source: Instant activation after payment.
ro: Activare instantanee după plată.

source: Pay Securely
ro: Plătește în Siguranță

source: Secure SSL Encryption • No Hidden Fees
ro: Criptare SSL Securizată • Fără taxe ascunse

source: Voucher Applied!
ro: Voucher Aplicat!

source: Your 100%% discount is ready. Click below to activate your premium plan instantly.
ro: Reducerea ta de 100%% este gata. Apasă mai jos pentru a-ți activa pachetul premium instant.

source: Activate Plan Now
ro: Activează Pachetul Acum

source: Enter your code to apply a discount.
ro: Introdu codul tău pentru a aplica reducerea.

source: e.g. EXPO2026
ro: ex: EXPO2026

source: Remove and use different code
ro: Elimină și folosește un alt cod

source: Back to Plans
ro: Înapoi la Pachete

source: You do not have permission to export data for this event.
ro: Nu ai permisiuni necesare pentru exportul datelor acestui eveniment.

source: Type
ro: Tip Adresare

source: Guest Name
ro: Nume Invitat

source: Number Attending
ro: Număr Confirmări Locuri

source: Invitation Method
ro: Metoda de trimitere a invitației

source: Meal Preferences
ro: Preferințe Meniu

source: Confirmation details are updated. Thank you!
ro: Detaliile răspunsului RSVP au fost înregistrate. Îți mulțumim!

source: Thank you for confirmation!
ro: Prezența ta este o bucurie. Răspuns trimis cu succes!

source: Join us for %(title)s!
ro: Te invităm la %(title)s! Fii alături de noi.

source: Thank you! Your contact information has been updated.
ro: Super! Datele tale de contact (telefon/email) au fost salvate cu succes în agendă.

source: Welcome to InvApp!
ro: Bine ai venit în familia InvApp!

source: Hello %(username)s, Thank you for creating an account on our platform. You can now login to create invitations. Respectfully, InvApp Team
ro: Salutare %(username)s, Contul tău a fost creat cu succes. Intră în dashboard și personalizează prima ta invitație digitală - este la fel de simplu precum completarea unui profil. Spor la organizare, Echipa InvApp

source: Registration successful! A confirmation email has been sent.
ro: Contul a fost creat cu succes! Verifică-ți și căsuța de Spam pentru email-ul de confirmare.

source: Registration successful, but we could not send a confirmation email.
ro: Cont creat cu succes, însă serverul de e-mail a întâmpinat o eroare internă de moment.

source: Table '%(name)s' deleted successfully.
ro: Masa '%(name)s' a fost ștearsă.

source: You do not have permission to manage assignments.
ro: Nu ai permisiuni pentru a modifica organizarea meselor în acest eveniment.

source: Guest unassigned successfully.
ro: Invitatul a fost scos de la masă cu succes.

source: Error: %(error)s
ro: A intervenit o eroare: %(error)s

source: %(name)s is already assigned.
ro: Invitatul %(name)s este deja plasat la altă masă.

source: Assigned %(guest)s to %(table)s.
ro: Ai așezat pe %(guest)s la masa: %(table)s.

source: Invalid selection.
ro: Selecție nevalidă.

source: Table assignment is not included in your plan.
ro: Așezarea interactivă la mese este o funcție Premium. Accesează prețurile pentru upgrade.

source: %(count)d guest(s) assigned to %(table)s.
ro: %(count)d invitați au fost asociați la %(table)s.

source: Guest unassigned.
ro: S-a eliberat locul invitatului de la masă.

source: Event limit reached. Upgrade to create more.
ro: Număr maxim de evenimente atins. Treci la un pachet superior.

source: Event '%(title)s' created!
ro: Evenimentul '%(title)s' tocmai a prins viață!

source: Event updated.
ro: Toate detaliile evenimentului au fost actualizate și salvate.

source: Deleting events is locked on your plan.
ro: Ștergerea evenimentelor este blocată din motive de securitate la nivelul tău actual de abonament.
